БухЭксп/Enums/CW_ПорядокОтраженияДоходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияДоходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СобственнаяУслуга</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеДоходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/Enums/CW_ПорядокОтраженияЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>CW_ПорядокОтраженияЗатрат</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Перевыставление</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Затраты</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПеревыставлениеПоСтавкам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрочиеРасходы</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

БухЭксп/CommonForms/CW_ФормаГрупповогоРедактированияТЧ/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// если форма вызвана без параметризации (не из документа),
	// то блокируем ее открытие
	Если НЕ Параметры.Свойство("Док") Тогда
		Отказ = Истина;
	КонецЕсли;
	ОтображатьСтатьюЗатрат 			= CW_Настройки.ПолучитьНастройкуПользователя(CW_Настройки.Пользователь(),"ОтображатьСтатьюЗатрат");
	
	// запомним параметры для дальнейшего использования
	Док = Параметры.Док;
	Кол = Параметры.Строк;
	
	Параметры.Свойство("Организация",Организация);
	Параметры.Свойство("ЦенаСНДС",ЦенаСНДС);
	Параметры.Свойство("ПоказатьСпособУчетаНДС",ПоказатьСпособУчетаНДС);
	Параметры.Свойство("ПоказатьПодразделение", ПоказатьПодразделение); 
	
	Параметры.Свойство("ИспользуетсяОгранчиениеУслуг", 	ИспользуетсяОгранчиениеУслуг); 
	Параметры.Свойство("АдресУслугПоДоговору", 			АдресУслугПоДоговору); 
	
	Если ПустаяСтрока(АдресУслугПоДоговору) Тогда
		ИспользуетсяОгранчиениеУслуг = Ложь;
	КонецЕсли;
	
	// в зависимости от количества выделенных отрисуем диалог
	Элементы.Распределить.Видимость = (Кол > 1);
	
	// заполним для реквизитов списки для выбора
	СформироватьСписокиВариантовДляВыбора();
	
	// установим значение реквизитов по умолчанию
	Количество = 1;
	
	// в качестве реквизита для группового редактирования установим 
	// реквизит на котором установлен курсов в документе 
	ТекущийРеквизит 				= Параметры.ТекущийРеквизит;
	ТекущееЗначение 				= Параметры.ТекущееЗначение;
	ТекущееЗначениеДополнительное 	= Параметры.ТекущееЗначениеДополнительное;	
	
	//Подсистема.УчетПриложенийДоговоров
	Если Параметры.Свойство("ТекущееЗначениеПриложение") Тогда
		ТекущееЗначениеПриложение 		= Параметры.ТекущееЗначениеПриложение;	
	КонецЕсли;
	//Подсистема.УчетПриложенийДоговоров
	
	Если ТекущийРеквизит = "Количество" Тогда
		Реквизит = "Количество";
		Количество = ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "Цена" Тогда
		Реквизит = "Цена";
		Сумма = ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "Подразделение" Тогда
		Реквизит 		= "Подразделение";
		Подразделение 	= ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "СтатьяЗатрат" Тогда
		Реквизит 		= "СтатьяЗатрат";
		СтатьяЗатрат 	= ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "Сумма" Тогда
		Реквизит = "Сумма";
		Сумма = ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "СтавкаНДС" Тогда
		Реквизит = "Ставка НДС";
		СтавкаНДС = ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "НДС" Тогда
		Реквизит = "Сумма НДС";
		Сумма = ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "Всего" Тогда
		Реквизит = "Всего";
		Сумма = ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "Номенклатура" Тогда
		Реквизит = "Номенклатура";
		Номенклатура = ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "ПорядокОтражения" Тогда
		Реквизит = "Порядок отражения";
		Если Док = "Доходы" Тогда
			ПорядокОтраженияД = ТекущееЗначение;
		Иначе
			ПорядокОтраженияР = ТекущееЗначение;
		КонецЕсли; 
	ИначеЕсли ТекущийРеквизит = "ДокументРасходов" Тогда
		Реквизит = "Документ затрат";
		ДокументЗатрат = ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "Покупатель" Тогда
		Реквизит = "Клиент / Договор";
		Клиент 	= ТекущееЗначение;
		Договор = ТекущееЗначениеДополнительное;
		
		//Подсистема.УчетПриложенийДоговоров
		ПриложениеКДоговору = ТекущееЗначениеПриложение;
		УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("CW_ДоговорПоГрузоперевозкам", Договор));
		//Подсистема.УчетПриложенийДоговоров
	
	ИначеЕсли ТекущийРеквизит = "СпособУчетаНДС" Тогда
		Реквизит = "Способ учета НДС";
		СпособУчетаНДС = ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "Представление" Тогда
		Реквизит = "Представление";
		Представление = ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "ПрочиеДоходы" 
		или ТекущийРеквизит = "ПрочиеРасходы" Тогда
		Реквизит 				= ТекущийРеквизит;
		ПрочиеДоходыИРасходы 	= ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "Грузоперевозка" Тогда
		Реквизит 		= "Грузоперевозка";
		Грузоперевозка 	= ТекущееЗначение;
	ИначеЕсли ТекущийРеквизит = "РеестрыНДС0Приложение" Тогда
		Реквизит 				= "РеестрыНДС0Приложение";
		РеестрыНДС0Приложение 	= ТекущееЗначение;
	Иначе
		Реквизит = "Номенклатура";
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 
	УправлениеДиалогом();
	 
КонецПроцедуры
	
// Управление диалогом формы
&НаКлиенте 
Процедура УправлениеДиалогом()
	
	мРеквизитыОрганизация = Новый Массив;
	мРеквизитыОрганизация.Добавить("Клиент / Договор");
	мРеквизитыОрганизация.Добавить("Подразделение");
	
	ВыбранноеЗначение = Реквизит;
	Если ВыбранноеЗначение = "Номенклатура" Тогда
		ТекущаяСтранциа = Элементы.ГруппаНоменклатура; 
	ИначеЕсли ВыбранноеЗначение = "Порядок отражения" Тогда
		Если Док = "Доходы" Тогда
			ТекущаяСтранциа = Элементы.ГруппаПорядокОтраженияД;
		Иначе
			ТекущаяСтранциа = Элементы.ГруппаПорядокОтраженияР;;			
		КонецЕсли;	
	ИначеЕсли ВыбранноеЗначение = "Документ затрат" Тогда
		ТекущаяСтранциа =Элементы.ГруппаДокументЗатрат;
	ИначеЕсли ВыбранноеЗначение = "СтатьяЗатрат" Тогда
		ТекущаяСтранциа =Элементы.ГруппаСтатьяЗатрат;
	ИначеЕсли ВыбранноеЗначение = "Подразделение" Тогда
		ТекущаяСтранциа =Элементы.ГруппаПодразделение;
	ИначеЕсли ВыбранноеЗначение = "Клиент / Договор" Тогда
		ТекущаяСтранциа =Элементы.ГруппаКлиентДоговор;
	ИначеЕсли ВыбранноеЗначение = "Количество" Тогда
		ТекущаяСтранциа =Элементы.ГруппаКоличество;
	ИначеЕсли ВыбранноеЗначение = "Цена" Тогда
		Элементы.Сумма.Заголовок = "Цена"+?(ЦенаСНДС, " (с НДС)","");
		ТекущаяСтранциа =Элементы.ГруппаСумма;
	ИначеЕсли ВыбранноеЗначение = "Сумма" Тогда
		Элементы.Сумма.Заголовок = "Сумма";
		ТекущаяСтранциа =Элементы.ГруппаСумма;
	ИначеЕсли ВыбранноеЗначение = "Ставка НДС" Тогда
		ТекущаяСтранциа =Элементы.ГруппаСтавкаНДС;
	ИначеЕсли ВыбранноеЗначение = "Сумма НДС" Тогда
		Элементы.Сумма.Заголовок = "Сумма НДС";
		ТекущаяСтранциа =Элементы.ГруппаСумма;
	ИначеЕсли ВыбранноеЗначение = "Всего" Тогда
		Элементы.Сумма.Заголовок = "Всего";
		ТекущаяСтранциа = Элементы.ГруппаСумма;
	ИначеЕсли ВыбранноеЗначение = "Способ учета НДС" Тогда
		ТекущаяСтранциа =	Элементы.ГруппаСпособУчетаНДС;
	ИначеЕсли ВыбранноеЗначение = "Представление" Тогда
		ТекущаяСтранциа =	Элементы.ГруппаПредставление;
	ИначеЕсли ВыбранноеЗначение = "ПрочиеДоходы" 
		или ВыбранноеЗначение = "ПрочиеРасходы" Тогда
		ТекущаяСтранциа =	Элементы.ГруппаСтатьяПрочихДоходовРасходов;
	ИначеЕсли ВыбранноеЗначение = "Грузоперевозка" Тогда
		ТекущаяСтранциа =	Элементы.ГруппаГрзуоперевозка;
	ИначеЕсли ВыбранноеЗначение = "РеестрыНДС0Приложение" Тогда
		ТекущаяСтранциа =	Элементы.ГруппаРеестрыНДС0Приложение;
	КонецЕсли;	 
	
	Элементы.Организация.Видимость = НЕ мРеквизитыОрганизация.Найти(ВыбранноеЗначение) = Неопределено;
	
	Элементы.Страницы.ТекущаяСтраница = ТекущаяСтранциа;
	
КонецПроцедуры // УправлениеДиалогом()

// Формирует список возможных вариантов для выбора в реквизите "Реквизит"
&НаСервере 
Процедура СформироватьСписокиВариантовДляВыбора()
	
	// список для реквизита "Реквизит"
	#Область ОбластьРеквизит
		Элементы.Реквизит.СписокВыбора.Очистить();
		Элементы.Реквизит.СписокВыбора.Добавить("Грузоперевозка",		"Грузоперевозка");
		Элементы.Реквизит.СписокВыбора.Добавить("Номенклатура",			"Номенклатура");
		Элементы.Реквизит.СписокВыбора.Добавить("Представление",		"Представление");
		Элементы.Реквизит.СписокВыбора.Добавить("Порядок отражения",	"Порядок отражения");
		
		Если Док = "Доходы" Тогда
			Элементы.Реквизит.СписокВыбора.Добавить("ПрочиеДоходы",			"Статья прочих доходов");
			Элементы.Реквизит.СписокВыбора.Добавить("Документ затрат","Документ затрат");
		Иначе
			Элементы.Реквизит.СписокВыбора.Добавить("ПрочиеРасходы",			"Статья прочих расходов");
			Элементы.Реквизит.СписокВыбора.Добавить("Клиент / Договор","Клиент / Договор");
			
			Если ПоказатьПодразделение Тогда
				Элементы.Реквизит.СписокВыбора.Добавить("Подразделение","Подразделение");
			КонецЕсли;
		КонецЕсли;	
		
		Если ОтображатьСтатьюЗатрат Тогда
				Элементы.Реквизит.СписокВыбора.Добавить("СтатьяЗатрат","Статья затрат");
		КонеЦесли;
		
		Элементы.Реквизит.СписокВыбора.Добавить("РеестрыНДС0Приложение",	"Реестр НДС 0%");
		
		Элементы.Реквизит.СписокВыбора.Добавить("Количество","Количество");
		Элементы.Реквизит.СписокВыбора.Добавить("Цена","Цена");
		Элементы.Реквизит.СписокВыбора.Добавить("Сумма","Сумма");
		Элементы.Реквизит.СписокВыбора.Добавить("Ставка НДС","Ставка НДС");
		
		Если ПоказатьСпособУчетаНДС Тогда
			Элементы.Реквизит.СписокВыбора.Добавить("Способ учета НДС","Способ учета НДС");
		КонецЕсли;
		
		Элементы.Реквизит.СписокВыбора.Добавить("Сумма НДС","Сумма НДС");
		Элементы.Реквизит.СписокВыбора.Добавить("Всего","Всего");
	#КонецОбласти 	
	
	// список для реквизита "ПорядокОтраженияД" (для доходов)
	#Область ОбластьПорядокОтраженияД
		Элементы.ПорядокОтраженияД.СписокВыбора.Очистить();
		Элементы.ПорядокОтраженияД.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.СобственнаяУслуга"));
		Элементы.ПорядокОтраженияД.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.Перевыставление"));
		ПеревыставлениеПоСтавкам = ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
		Если (ПеревыставлениеПоСтавкам) Тогда
			Элементы.ПорядокОтраженияД.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПеревыставлениеПоСтавкам"));
		КонецЕсли; 
		
		Элементы.ПорядокОтраженияД.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияДоходов.ПрочиеДоходы"));

	#КонецОбласти 
	
	// список для реквизита "ПорядокОтраженияР" (для расходов)
	#Область ОбластьПорядокОтраженияР
		Элементы.ПорядокОтраженияР.СписокВыбора.Очистить();
		Элементы.ПорядокОтраженияР.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Затраты"));
		Элементы.ПорядокОтраженияР.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.Перевыставление"));
		ПеревыставлениеПоСтавкам = ПолучитьФункциональнуюОпцию("CW_ИспользованиеСхемыПеревыставленияПоСтавкам");
		Если (ПеревыставлениеПоСтавкам) Тогда
			Элементы.ПорядокОтраженияР.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПеревыставлениеПоСтавкам"));
		КонецЕсли; 
		Элементы.ПорядокОтраженияР.СписокВыбора.Добавить(ПредопределенноеЗначение("Перечисление.CW_ПорядокОтраженияЗатрат.ПрочиеРасходы"));
	#КонецОбласти 
	
КонецПроцедуры // СформироватьСписокВариантовДляВыбора()

&НаКлиенте
Процедура РеквизитОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Реквизит = ВыбранноеЗначение;
	УправлениеДиалогом();
	
КонецПроцедуры

&НаКлиенте
Функция ПолучитьОтвет();
	
	Ответ = Новый Структура();
	Ответ.Вставить("Реквизит", Реквизит);
	
	Если Реквизит = "Номенклатура" Тогда
		Значение = Номенклатура;
	ИначеЕсли Реквизит = "Подразделение" Тогда
		Значение = Подразделение;
	ИначеЕсли Реквизит = "Порядок отражения" Тогда
		Если Док = "Доходы" Тогда
			Значение = ПорядокОтраженияД;
		Иначе
			Значение = ПорядокОтраженияР;			
		КонецЕсли;	
	ИначеЕсли Реквизит = "Документ затрат" Тогда
		Значение = ДокументЗатрат;
	ИначеЕсли Реквизит = "СтатьяЗатрат" Тогда
		Значение = СтатьяЗатрат;
	ИначеЕсли Реквизит = "Клиент / Договор" Тогда
		Значение = Клиент;
		Ответ.Вставить("Договор", Договор);
		Ответ.Вставить("УчетПриложенийПоДоговору", 	ПолучитьУчетПриложенийПоДоговору(Договор));
		Ответ.Вставить("ПриложениеКДоговору", 		ПриложениеКДоговору);
	ИначеЕсли Реквизит = "Количество" Тогда
		Значение = Количество;
	ИначеЕсли Реквизит = "Цена" Тогда
		Ответ.Вставить("Распределить", Распределить);
		Значение = Сумма;
	ИначеЕсли Реквизит = "Сумма" Тогда
		Ответ.Вставить("Распределить", Распределить);
		Значение = Сумма;
	ИначеЕсли Реквизит = "Ставка НДС" Тогда
		Значение = СтавкаНДС;
	ИначеЕсли Реквизит = "Сумма НДС" Тогда
		Ответ.Вставить("Распределить", Распределить);
		Значение = Сумма;
	ИначеЕсли Реквизит = "Всего" Тогда
		Ответ.Вставить("Распределить", Распределить);
		Значение = Сумма;
	ИначеЕсли Реквизит = "Способ учета НДС" Тогда
		Значение = СпособУчетаНДС;
	ИначеЕсли Реквизит = "Представление" Тогда
		Ответ.Вставить("Дополнять", ДополнятьПредставление);
		Значение = Представление;
	ИначеЕсли Реквизит = "ПрочиеДоходы" или Реквизит = "ПрочиеРасходы" Тогда
		Значение = ПрочиеДоходыИРасходы;
	ИначеЕсли Реквизит = "Грузоперевозка" Тогда
		Значение = Грузоперевозка;
	ИначеЕсли Реквизит = "РеестрыНДС0Приложение" Тогда
		Значение =	РеестрыНДС0Приложение;
	КонецЕсли;	
	
	Ответ.Вставить("Значение", Значение);
	
	Возврат Ответ;
	
КонецФункции	

&НаКлиенте
Процедура _Выполнить(Команда)
	
	Ответ = ПолучитьОтвет();
	
	ЭтаФорма.Закрыть(Ответ);
	 
КонецПроцедуры

&НаКлиенте
Процедура Отмена(Команда)
	
	ЭтаФорма.Закрыть(Неопределено);
	 
КонецПроцедуры

&НаСервере
Процедура ДоговорПриИзмененииНаСервере()
	
	//Подсистема.УчетПриложенийДоговоров
	УстановитьПараметрыФункциональныхОпцийФормы(Новый Структура("CW_ДоговорПоГрузоперевозкам", Договор));
	//Подсистема.УчетПриложенийДоговоров
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьУчетПриложенийПоДоговору(ТекущийДоговор)
	
	Возврат  ТекущийДоговор.ИспользуютсяПриложения;
	
КонецФункции

&НаКлиенте
Процедура ДоговорПриИзменении(Элемент)
	ДоговорПриИзмененииНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ГрузоперевозкаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ГрузоперевозкаЗакрыта(ВыбранноеЗначение) Тогда
		СтандартнаяОбработка = Ложь;
		ПоказатьПредупреждение(, "Выбранная грузоперевозка заблокирована для использования в документах!");
	КонецЕсли; 
	
КонецПроцедуры

Функция ГрузоперевозкаЗакрыта(ВыбранноеЗначение) 
	
	ДатаЗакрытия = CW_Мониторинг.ПолучитьДатуЗакрытия(ВыбранноеЗначение);
	Возврат ДатаЗакрытия <> Дата(1,1,1); 
	
КонецФункции

&НаКлиенте
Процедура НоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	Если ИспользуетсяОгранчиениеУслуг Тогда
		Элемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.НеИспользовать;
		
		СписокЗначений = Новый СписокЗначений;
		Если ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
			МассивУслуг =  _УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору);
			СписокЗначений.ЗагрузитьЗначения(МассивУслуг);
		КонецЕсли; 
		
		Если СписокЗначений.Количество() = 0 Тогда
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Не определен список услуг по договору!",,"Номенклатура");
		Конецесли;
		
		ДанныеВыбора = СписокЗначений;
		СтандартнаяОбработка = Ложь;
		
	Иначе
		Элемент.ИсторияВыбораПриВводе = ИсторияВыбораПриВводе.Авто;
	Конецесли;

КонецПроцедуры


&НаКлиенте
Процедура НоменклатураАвтоПодбор(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, Ожидание, СтандартнаяОбработка)

	Если Не ПустаяСтрока(Текст) и ЭтоАдресВременногоХранилища(АдресУслугПоДоговору) Тогда
		Элемент.РежимВыбораИзСписка  = ИспользуетсяОгранчиениеУслуг;	
		Если ИспользуетсяОгранчиениеУслуг Тогда 
			Если Элемент.СписокВыбора.Количество()> 0 Тогда
				Элемент.СписокВыбора.Очистить();
			КонецЕсли;
			
			Элемент.СписокВыбора.ЗагрузитьЗначения(_УФС.ПолучитьУслугиДоговора(АдресУслугПоДоговору));   
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры
